FEniCSx_OpenFOAM/fluid/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 273.15;

boundaryField
{   
    leftWall
    {
        type            fixedValue;
        value           $internalField;
    }
    

    rightWall
    {   
        type            customLinearInterpolationCoupledBoundary;
        value           uniform 273.15;
        kappaMethod     fluidThermo;
    }


    "(top|bottom)Wall"
    {
        type            zeroGradient;
    }

    frontAndBackPlanes
    {
        type            empty;
    }
}

// ************************************************************************* //
